src/cf/DataProcessors/GitlabTimeLog.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>GitlabTimeLog</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>userID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>After</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BaseURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Таймлог</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТаймлогИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IssueIID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Project</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Summary</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Duration</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Date</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/GitlabTimeLog/Ext/ObjectModule.bsl
// Модуль объекта обработки GitlabTimeLog
// Команды для работы с GitLab API через ИнтеграцияGitlab.
//
// Структура команд:
//   GITL-TL-004: Инициализация соединения с GitLab API
//   GITL-TL-001: Получение списка проектов пользователя
//   GITL-TL-002: Получение списка задач (Issues) пользователя
//   GITL-TL-010: Преобразование данных из GitLab в локальный формат
//   GITL-TL-003: Получение таймлогов для конкретной задачи
//   GITL-TL-005: Получение таймлогов сотрудника за период
//   GITL-TL-009: Получение таймлогов за конкретную дату
//   GITL-TL-006: Добавление записи времени (timelog)
//   GITL-TL-007: Удаление записи времени (timelog)
//   GITL-TL-008: Получение статистики времени по задаче
//   GITL-TL-011: Загрузка таймлогов в таблицу результата
//   GITL-TL-012: Валидация данных перед отправкой в GitLab
//   GITL-TL-013: Формирование отчёта по таймлогам

#Область ПрограммныйИнтерфейс

// ============================================================================
// GITL-TL-004: Команда инициализации соединения с GitLab API
// ============================================================================

// Устанавливает базовый URL GitLab сервера.
//
// Параметры:
//   БазовыйURL - Строка - URL GitLab сервера, например "https://gitlab.example.com".
//
Процедура КомандаИнициализацииБазовыйURL(Знач БазовыйURL) Экспорт
	
	ЭтотОбъект.BaseURL = БазовыйURL;
	
КонецПроцедуры

// Устанавливает токен аутентификации для GitLab API.
//
// Параметры:
//   ТокенДоступа - Строка - персональный токен доступа GitLab (PRIVATE-TOKEN).
//
Процедура КомандаИнициализацииТокен(Знач ТокенДоступа) Экспорт
	
	ЭтотОбъект.Токен = ТокенДоступа;
	
КонецПроцедуры

// Устанавливает идентификатор пользователя GitLab.
//
// Параметры:
//   ПользовательID - Число - идентификатор пользователя в GitLab.
//
Процедура КомандаИнициализацииПользователь(Знач ПользовательID) Экспорт
	
	ЭтотОбъект.userID = Строка(ПользовательID);
	
КонецПроцедуры

// Проверяет корректность настроек подключения к GitLab API.
//
// Возвращаемое значение:
//   Булево - Истина при успешной проверке, Ложь иначе.
//
Функция КомандаИнициализацииПроверитьНастройки() Экспорт
	
	Результат = Истина;
	Ошибки = Новый Массив;
	
	Если ПустаяСтрока(ЭтотОбъект.BaseURL) Тогда
		Ошибки.Добавить("Не установлен базовый URL GitLab сервера.");
		Результат = Ложь;
	КонецЕсли;
	
	Если ПустаяСтрока(ЭтотОбъект.Токен) Тогда
		Ошибки.Добавить("Не установлен токен доступа GitLab API.");
		Результат = Ложь;
	КонецЕсли;
	
	Если ПустаяСтрока(ЭтотОбъект.userID) Тогда
		Ошибки.Добавить("Не указан идентификатор пользователя GitLab.");
		Результат = Ложь;
	КонецЕсли;
	
	// Возвращаем результат через атрибуты формы
	СостояниеПодключения = ?(Результат, "Подключено", "Не подключено");
	ОписаниеОшибок = ?(Результат, "Все настройки корректны.", 
		"Выявлены ошибки: " + СоединитьСтроки(Ошибки, "; "));
	
	Возврат Результат;
	
КонецФункции

// ============================================================================
// GITL-TL-001: Команда получения списка проектов пользователя
// ============================================================================

// Получает список проектов GitLab, доступных пользователю.
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица с колонками:
//     * проект_id       - Число - идентификатор проекта в GitLab.
//     * name            - Строка - название проекта.
//     * web_url         - Строка - ссылка на проект.
//     * namespace_path  - Строка - путь к пространству имён (группе).
//
Функция КомандаПолучитьПроекты() Экспорт
	
	Интеграция = Обработки.ИнтеграцияGitlab.Создать();
	Интеграция.УстановитьБазовыйURL(ЭтотОбъект.BaseURL);
	Интеграция.УстановитьТокен(ЭтотОбъект.Токен);
	
	Возврат Интеграция.ПолучитьПроекты("active");
	
КонецФункции

// ============================================================================
// GITL-TL-002: Команда получения списка задач (Issues) пользователя
// ============================================================================

// Получает список назначенных задач пользователя.
//
// Параметры:
//   Состояние - Строка - состояние задач ("opened", "closed", "all").
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица с колонками:
//     * issue_id      - Число - идентификатор задачи в GitLab.
//     * issue_iid     - Число - внутренний ID задачи в проекте.
//     * title         - Строка - заголовок задачи.
//     * web_url       - Строка - ссылка на задачу.
//     * проект_id     - Число - идентификатор проекта в GitLab.
//     * состояние     - Строка - текущее состояние задачи.
//
Функция КомандаПолучитьЗадачи(Знач Состояние = "opened") Экспорт
	
	ПроверитьПодключение();
	
	Интеграция = Обработки.ИнтеграцияGitlab.Создать();
	Интеграция.УстановитьБазовыйURL(ЭтотОбъект.BaseURL);
	Интеграция.УстановитьТокен(ЭтотОбъект.Токен);
	
	ПользовательID = Число(ЭтотОбъект.userID);
	
	Возврат Интеграция.ПолучитьНазначенныеЗадачи(ПользовательID, Состояние);
	
КонецФункции

// ============================================================================
// GITL-TL-010: Команда преобразования данных из GitLab в локальный формат
// ============================================================================

// Преобразует JSON ответ от GitLab API в ТаблицуЗначений с унифицированной структурой.
//
// Параметры:
//   ДанныеJSON - Строка - тело ответа в формате JSON.
//   ТипДанных  - Строка - тип данных ("timelogs", "timeentries", "issues", "projects").
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица с преобразованными данными.
//
Функция КомандаПреобразоватьДанные(Знач ДанныеJSON, Знач ТипДанных) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	
	ТипДанных = СтрЗаменить(ТипДанных, " ", "");
	
	Если ТипДанных = "timelogs" Тогда
			РЕЗУЛЬТАТ.Колонки.Добавить("timelog_id", Новый ОписаниеТипов("Число"));
			Результат.Колонки.Добавить("project_name", Новый ОписаниеТипов("Строка"));
			Результат.Колонки.Добавить("issue_title", Новый ОписаниеТипов("Строка"));
			Результат.Колонки.Добавить("duration_seconds", Новый ОписаниеТипов("Число"));
			Результат.Колонки.Добавить("spent_at", Новый ОписаниеТипов("Строка"));
			Результат.Колонки.Добавить("description", Новый ОписаниеТипов("Строка"));
			
		ИначеЕсли ТипДанных = "timeentries"   Тогда
			РЕЗУЛЬТАТ.Колонки.Добавить("timelog_id", Новый ОписаниеТипов("Число"));
			Результат.Колонки.Добавить("project_name", Новый ОписаниеТипов("Строка"));
			Результат.Колонки.Добавить("issue_iid", Новый ОписаниеТипов("Число"));
			Результат.Колонки.Добавить("issue_title", Новый ОписаниеТипов("Строка"));
			Результат.Колонки.Добавить("duration_seconds", Новый ОписаниеТипов("Число"));
			Результат.Колонки.Добавить("spent_at", Новый ОписаниеТипов("Строка"));
			Результат.Колонки.Добавить("description", Новый ОписаниеТипов("Строка"));
			Результат.Колонки.Добавить("web_url", Новый ОписаниеТипов("Строка"));
			
		ИначеЕсли ТипДанных = "issues" Тогда
			РЕЗУЛЬТАТ.Колонки.Добавить("issue_id", Новый ОписаниеТипов("Число"));
			Результат.Колонки.Добавить("issue_iid", Новый ОписаниеТипов("Число"));
			Результат.Колонки.Добавить("title", Новый ОписаниеТипов("Строка"));
			Результат.Колонки.Добавить("web_url", Новый ОписаниеТипов("Строка"));
			Результат.Колонки.Добавить("проект_id", Новый ОписаниеТипов("Число"));
			Результат.Колонки.Добавить("состояние", Новый ОписаниеТипов("Строка"));
			
		ИначеЕсли ТипДанных = "projects" Тогда
			РЕЗУЛЬТАТ.Колонки.Добавить("проект_id", Новый ОписаниеТипов("Число"));
			Результат.Колонки.Добавить("name", Новый ОписаниеТипов("Строка"));
			Результат.Колонки.Добавить("web_url", Новый ОписаниеТипов("Строка"));
			Результат.Колонки.Добавить("namespace_path", Новый ОписаниеТипов("Строка"));
			
		Иначе
			ВызватьИсключение "Неизвестный тип данных: " + ТипДанных;
		КонецЕсли;
	
	Попытка
		Данные = КоннекторHTTP.JsonВОбъект(ДанныеJSON);
	Исключение
		// Ошибка парсинга JSON — возвращаем пустую таблицу с колонками
		Возврат Результат;
	КонецПопытки;
	
	Если ТипЗнч(Данные) <> Тип("Массив") Тогда
		Возврат Результат;
	КонецЕсли;
	
	// Заполняем результат в зависимости от типа данных
	Для Каждого Элемент Из Данные Цикл
		
		СтрокаТаблицы = Результат.Добавить();
		
		Если ТипДанных = "timelogs" Тогда
				СтрокаТаблицы.timelog_id     = Элемент.Получить("id");
				СтрокаТаблицы.duration_seconds = Элемент.Получить("time_spent");
				СтрокаТаблицы.spent_at       = Элемент.Получить("spent_at");
				СтрокаТаблицы.description    = Элемент.Получить("summary");
				
				Проект = Элемент.Получить("project");
				Если Проект <> Неопределено Тогда
					СтрокаТаблицы.project_name = Проект.Получить("name");
				КонецЕсли;
				
				Задача = Элемент.Получить("issue");
				Если Задача <> Неопределено Тогда
					СтрокаТаблицы.issue_title = Задача.Получить("title");
				КонецЕсли;
				
			ИначеЕсли ТипДанных = "timeentries" Тогда
				СтрокаТаблицы.timelog_id     = Элемент.Получить("id");
				СтрокаТаблицы.duration_seconds = Элемент.Получить("time_spent");
				СтрокаТаблицы.spent_at       = Элемент.Получить("spent_at");
				СтрокаТаблицы.description    = Элемент.Получить("note");
				
				Проект = Элемент.Получить("project");
				Если Проект <> Неопределено Тогда
					СтрокаТаблицы.project_name = Проект.Получить("name");
					СтрокаТаблицы.web_url      = Проект.Получить("web_url");
				КонецЕсли;
				
				Цель = Элемент.Получить("target");
				Если Цель <> Неопределено Тогда
					СтрокаТаблицы.issue_iid  = Цель.Получить("iid");
					СтрокаТаблицы.issue_title = Цель.Получить("title");
					Если ЗначениеЗаполнено(Цель.Получить("web_url")) Тогда
						СтрокаТаблицы.web_url = Цель.Получить("web_url");
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли ТипДанных = "issues" Тогда
				СтрокаТаблицы.issue_id   = Элемент.Получить("id");
				СтрокаТаблицы.issue_iid  = Элемент.Получить("iid");
				СтрокаТаблицы.title      = Элемент.Получить("title");
				СтрокаТаблицы.web_url    = Элемент.Получить("web_url");
				СтрокаТаблицы.проект_id  = Элемент.Получить("project_id");
				СтрокаТаблицы.состояние  = Элемент.Получить("state");
				
			ИначеЕсли ТипДанных = "projects" Тогда
				СтрокаТаблицы.проект_id    = Элемент.Получить("id");
				СтрокаТаблицы.name         = Элемент.Получить("name");
				СтрокаТаблицы.web_url      = Элемент.Получить("web_url");
				
				Namespace = Элемент.Получить("namespace");
				Если Namespace <> Неопределено Тогда
					СтрокаТаблицы.namespace_path = Namespace.Получить("full_path");
				КонецЕсли;
			
			ИНАЧЕ
				// Непредвиденный тип данных - пропускаем
			КонецЕсли;
		
		КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// ============================================================================
// GITL-TL-003: Команда получения таймлогов для конкретной задачи
// ============================================================================

// Получает список записей времени, затраченных на конкретную задачу.
//
// Параметры:
//   ПроектID  - Число - идентификатор проекта в GitLab.
//   IssueIID  - Число - внутренний идентификатор задачи (IID) в GitLab.
//   ДатаНач   - Строка - начальная дата периода в формате "ГГГГ-ММ-ДД".
//   ДатаКон   - Строка - конечная дата периода в формате "ГГГГ-ММ-ДД".
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица с колонками:
//     * timelog_id      - Число - идентификатор записи времени.
//     * project_name    - Строка - имя проекта.
//     * issue_title     - Строка - название задачи.
//     * duration_seconds- Число - длительность в секундах.
//     * spent_at        - Строка - дата затраченного времени.
//     * description     - Строка - описание работы.
//
Функция КомандаПолучитьТаймлогиЗадачи(Знач ПроектID, Знач IssueIID, Знач ДатаНач, Знач ДатаКон) Экспорт
	
	ПроверитьПодключение();
	
	Интеграция = Обработки.ИнтеграцияGitlab.Создать();
	Интеграция.УстановитьБазовыйURL(ЭтотОбъект.BaseURL);
	Интеграция.УстановитьТокен(ЭтотОбъект.Токен);
	
	Возврат Интеграция.ПолучитьТаймЛоги(ПроектID, IssueIID, ДатаНач, ДатаКон);
	
КонецФункции

// ============================================================================
// GITL-TL-005: Команда получения таймлогов сотрудника за период
// ============================================================================

// Получает все записи времени сотрудника за указанный период.
//
// Параметры:
//   ДатаНач - Строка - начальная дата периода в формате "ГГГГ-ММ-ДД".
//   ДатаКон - Строка - конечная дата периода в формате "ГГГГ-ММ-ДД".
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица с колонками:
//     * timelog_id      - Число - идентификатор записи времени.
//     * project_name    - Строка - имя проекта.
//     * issue_iid       - Число - внутренний ID задачи в GitLab.
//     * issue_title     - Строка - название задачи.
//     * duration_seconds- Число - длительность в секундах.
//     * spent_at        - Строка - дата затраченного времени.
//     * description     - Строка - описание работы (note).
//     * web_url         - Строка - ссылка на задачу.
//
Функция КомандаПолучитьТаймлогиСотрудника(Знач ДатаНач, Знач ДатаКон) Экспорт
	
	ПроверитьПодключение();
	
	Интеграция = Обработки.ИнтеграцияGitlab.Создать();
	Интеграция.УстановитьБазовыйURL(ЭтотОбъект.BaseURL);
	Интеграция.УстановитьТокен(ЭтотОбъект.Токен);
	
	ПользовательID = Число(ЭтотОбъект.userID);
	
	Возврат Интеграция.ПолучитьTimelogиПоСотруднику(ПользовательID, ДатаНач, ДатаКон);
	
КонецФункции

// ============================================================================
// GITL-TL-009: Команда получения таймлогов за конкретную дату
// ============================================================================

// Получает записи времени сотрудника за одну конкретную дату.
//
// Параметры:
//   Дата - Строка - дата в формате "ГГГГ-ММ-ДД".
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица с колонками (см. КомандаПолучитьТаймлогиСотрудника).
//
Функция КомандаПолучитьТаймлогиПоДате(Знач Дата) Экспорт
	
	ПроверитьПодключение();
	
	Интеграция = Обработки.ИнтеграцияGitlab.Создать();
	Интеграция.УстановитьБазовыйURL(ЭтотОбъект.BaseURL);
	Интеграция.УстановитьТокен(ЭтотОбъект.Токен);
	
	ПользовательID = Число(ЭтотОбъект.userID);
	
	// Формируем период из одной даты: on_or_after = Дата, before = Дата + 1 день
	ДатаНач = Дата;
	
	//+++
	// Левый модуль - от ИИ грязь - от меня
	//ДатаКон = РаботаСJSON.ДобавитьДень(Дата, 1);
	ДатаДатаНач = ПрочитатьДатуJSON(Дата, ФорматДатыJSON.ISO);
	ДатаДатаКон = ДатаДатаНач + 24*60*60;
	ДатаКон = ЗаписатьДатуJSON(ДатаДатаКон, ФорматДатыJSON.ISO);
	//---
	
	Возврат Интеграция.ПолучитьTimelogиПоСотруднику(ПользовательID, ДатаНач, ДатаКон);
	
КонецФункции

// ============================================================================
// GITL-TL-006: Команда добавления записи времени (timelog)
// ============================================================================

// Создаёт новую запись времени (timelog) в GitLab.
//
// Параметры:
//   ПроектID            - Число - идентификатор проекта в GitLab.
//   IssueIID            - Число - внутренний идентификатор задачи (IID).
//   ДлительностьВСекундах - Число - затраченное время в секундах.
//   ДатаРаботы          - Строка - дата работы в формате "ГГГГ-ММ-ДД".
//   Описание            - Строка - описание выполненной работы.
//
// Возвращаемое значение:
//   Число - идентификатор созданной записи timelog.
//
Функция КомандаДобавитьТаймлог(Знач ПроектID, Знач IssueIID, Знач ДлительностьВСекундах, Знач ДатаРаботы, Знач Описание) Экспорт
	
	ПроверитьПодключение();
	
	Интеграция = Обработки.ИнтеграцияGitlab.Создать();
	Интеграция.УстановитьБазовыйURL(ЭтотОбъект.BaseURL);
	Интеграция.УстановитьТокен(ЭтотОбъект.Токен);
	
	Возврат Интеграция.ДобавитьЗатраченноеВремя(ПроектID, IssueIID, ДлительностьВСекундах, ДатаРаботы, Описание);
	
КонецФункции

// ============================================================================
// GITL-TL-007: Команда удаления записи времени (timelog)
// ============================================================================

// Удаляет существующую запись времени в GitLab.
//
// Параметры:
//   ПроектID  - Число - идентификатор проекта в GitLab.
//   IssueIID  - Число - внутренний идентификатор задачи (IID).
//   TimelogID - Число - идентификатор записи времени.
//
// Возвращаемое значение:
//   Булево - Истина при успешном удалении, Ложь иначе.
//
Функция КомандаУдалитьТаймлог(Знач ПроектID, Знач IssueIID, Знач TimelogID) Экспорт
	
	ПроверитьПодключение();
	
	Интеграция = Обработки.ИнтеграцияGitlab.Создать();
	Интеграция.УстановитьБазовыйURL(ЭтотОбъект.BaseURL);
	Интеграция.УстановитьТокен(ЭтотОбъект.Токен);
	
	Возврат Интеграция.УдалитьTimelog(ПроектID, IssueIID, TimelogID);
	
КонецФункции

// ============================================================================
// GITL-TL-008: Команда получения статистики времени по задаче
// ============================================================================

// Получает статистику затраченного времени по задаче.
//
// Параметры:
//   ПроектID  - Число - идентификатор проекта в GitLab.
//   IssueIID  - Число - внутренний идентификатор задачи (IID).
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица с колонками:
//     * time_spent       - Строка - суммарное затраченное время.
//     * total_time_spent - Число - общее время в секундах.
//
Функция КомандаПолучитьСтатистикуВремени(Знач ПроектID, Знач IssueIID) Экспорт
	
	ПроверитьПодключение();
	
	Интеграция = Обработки.ИнтеграцияGitlab.Создать();
	Интеграция.УстановитьБазовыйURL(ЭтотОбъект.BaseURL);
	Интеграция.УстановитьТокен(ЭтотОбъект.Токен);
	
	Возврат Интеграция.ПолучитьСтатистикуВремени(ПроектID, IssueIID);
	
КонецФункции

// ============================================================================
// GITL-TL-011: Команда загрузки таймлогов в таблицу результата
// ============================================================================

// Заполняет табличную часть "Таймлог" данными из источника.
//
// Параметры:
//   ИсточникДанных - ТаблицаЗначений - данные для загрузки.
//
Процедура КомандаЗагрузитьТаймлогиВТаблицу(Знач ИсточникДанных)
	
	Если ИсточникДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Очищаем текущую таблицу
	ЭтотОбъект.Таймлог.Очистить();
	
	Для Каждого СтрокаИсточника Из ИсточникДанных Цикл
		
		СтрокаТаблицы = ЭтотОбъект.Таймлог.Добавить();
		СтрокаТаблицы.ТаймлогИД = СтрокаИсточника.timelog_id;
		СтрокаТаблицы.IssueIID  = СтрокаИсточника.issue_iid;
		СтрокаТаблицы.Project   = СтрокаИсточника.project_name;
		СтрокаТаблицы.Summary   = СтрокаИсточника.description;
		СтрокаТаблицы.Duration  = СтрокаИсточника.duration_seconds;
		СтрокаТаблицы.Date      = СтрокаИсточника.spent_at;
		
	КонецЦикла;
	
КонецПроцедуры

// ============================================================================
// GITL-TL-012: Команда валидации данных перед отправкой в GitLab
// ============================================================================

// Проверяет корректность данных для создания/обновления записи таймлога.
//
// Параметры:
//   ДанныеДляПроверки - Структура - данные с реквизитами:
//     * ПроектID            - Число
//     * IssueIID            - Число
//     * ДлительностьВСекундах - Число
//     * ДатаРаботы          - Строка
//     * Описание            - Строка
//
// Возвращаемое значение:
//   Структура - результат валидации с реквизитами:
//     * Корректно - Булево
//     * Ошибки    - Массив строк с описаниями ошибок.
//
Функция КомандаВалидироватьДанныеТаймлога(Знач ДанныеДляПроверки) Экспорт
	
	Результат = Новый Структура("Корректно, Ошибки", Истина, Новый Массив);
	
	Если ДанныеДляПроверки = Неопределено Тогда
		Результат.Корректно = Ложь;
		Результат.Ошибки.Добавить("Данные для проверки не указаны.");
		Возврат Результат;
	КонецЕсли;
	
	// Проверка ПроектID
	ПроектID = ДанныеДляПроверки.Получить("ПроектID");
	Если ПроектID = Неопределено ИЛИ НЕ Число(ПроектID) ИЛИ Число(ПроектID) <= 0 Тогда
		Результат.Корректно = Ложь;
		Результат.Ошибки.Добавить("ПроектID должен быть положительным числом.");
	КонецЕсли;
	
	// Проверка IssueIID
	IssueIID = ДанныеДляПроверки.Получить("IssueIID");
	Если IssueIID = Неопределено ИЛИ НЕ Число(IssueIID) ИЛИ Число(IssueIID) <= 0 Тогда
		Результат.Корректно = Ложь;
		Результат.Ошибки.Добавить("IssueIID должен быть положительным числом.");
	КонецЕсли;
	
	// Проверка ДлительностьВСекундах
	Длительность = ДанныеДляПроверки.Получить("ДлительностьВСекундах");
	Если Длительность = Неопределено ИЛИ НЕ Число(Длительность) ИЛИ Число(Длительность) <= 0 Тогда
		Результат.Корректно = Ложь;
		Результат.Ошибки.Добавить("ДлительностьВСекундах должна быть положительным числом.");
	КонецЕсли;
	
	// Проверка ДатаРаботы
	ДатаРаботы = ДанныеДляПроверки.Получить("ДатаРаботы");
	Если ДатаРаботы = Неопределено ИЛИ ПустаяСтрока(ДатаРаботы) Тогда
		Результат.Корректно = Ложь;
		Результат.Ошибки.Добавить("ДатаРаботы должна быть указана в формате ГГГГ-ММ-ДД.");
	ИначеЕсли НЕ СтрПодобнаПоРегулярномуВыражению(ДатаРаботы, "^\d{4}-\d{2}-\d{2}$") Тогда
		Результат.Корректно = Ложь;
		Результат.Ошибки.Добавить("ДатаРаботы должна быть в формате ГГГГ-ММ-ДД.");
	КонецЕсли;
	
	// Проверка Описание (опционально)
	Описание = ДанныеДляПроверки.Получить("Описание");
	Если Описание <> Неопределено ИЛИ НЕ ПустаяСтрока(Описание) Тогда
		Если стрДлина(Описание) > 1000 Тогда
			Результат.Корректно = Ложь;
			Результат.Ошибки.Добавить("Описание не должно превышать 1000 символов.");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// ============================================================================
// GITL-TL-013: Команда формирования отчёта по таймлогам
// ============================================================================

// Формирует сводный отчёт по таймлогам за период.
//
// Параметры:
//   ПериодНач - Строка - начальная дата периода в формате "ГГГГ-ММ-ДД".
//   ПериодКон - Строка - конечная дата периода в формате "ГГГГ-ММ-ДД".
//
// Возвращаемое значение:
//   ТаблицаЗначений - сводный отчёт с колонками:
//     * project_name    - Строка - имя проекта.
//     * issue_iid       - Число - ID задачи.
//     * issue_title     - Строка - название задачи.
//     * total_seconds   - Число - суммарное время в секундах.
//     * total_hours     - Число - суммарное время в часах.
//     * record_count    - Число - количество записей.
//
Функция КомандаСформироватьОтчёт(Знач ПериодНач, Знач ПериодКон) Экспорт
	
	ПроверитьПодключение();
	
	// Получаем все таймлоги сотрудника за период
	ИсточникДанных = КомандаПолучитьТаймлогиСотрудника(ПериодНач, ПериодКон);
	
	Если ИсточникДанных.Количество() = 0 Тогда
		// Возвращаем пустую таблицу с нужной структурой
		Возврат СоздатьПустойОтчёт();
	КонецЕсли;
	
	// Группируем данные по проекту и задаче
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("project_name",    Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("issue_iid",       Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("issue_title",     Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("total_seconds",   Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("total_hours",     Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("record_count",    Новый ОписаниеТипов("Число"));
	
	// Создаём ключи для группировки
	Группировка = Новый Соответствие;
	
	Для Каждого Запись Из ИсточникДанных Цикл
		
		Ключ = СтрШаблон("%1|%2", Запись.project_name, Запись.issue_iid);
		
		Если Группировка.Содержит(Ключ) Тогда
			СтрокаОтчёта = Группировка.Получить(Ключ);
			СтрокаОтчёта.total_seconds = СтрокаОтчёта.total_seconds + Запись.duration_seconds;
			СтрокаОтчёта.record_count  = СтрокаОтчёта.record_count + 1;
		Иначе
			НоваяСтрока = Результат.Добавить();
			НоваяСтрока.project_name   = Запись.project_name;
			НоваяСтрока.issue_iid      = Запись.issue_iid;
			НоваяСтрока.issue_title    = Запись.issue_title;
			НоваяСтрока.total_seconds  = Запись.duration_seconds;
			НоваяСтрока.total_hours    = Запись.duration_seconds / 3600;
			НоваяСтрока.record_count   = 1;
			
			Группировка.Вставить(Ключ, НоваяСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

// Проверка подключения к GitLab API.
//
Процедура ПроверитьПодключение()
	
	Если ПустаяСтрока(ЭтотОбъект.BaseURL) Тогда
		ВызватьИсключение "Не установлен базовый URL GitLab сервера.";
	КонецЕсли;
	
	Если ПустаяСтрока(ЭтотОбъект.Токен) Тогда
		ВызватьИсключение "Не установлен токен доступа GitLab API.";
	КонецЕсли;
	
	Если ПустаяСтрока(ЭтотОбъект.userID) Тогда
		ВызватьИсключение "Не указан идентификатор пользователя GitLab.";
	КонецЕсли;
	
КонецПроцедуры

// Создаёт пустую таблицу для отчёта.
//
// Возвращаемое значение:
//   ТаблицаЗначений - пустая таблица с описанными колонками.
//
Функция СоздатьПустойОтчёт() Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("project_name",    Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("issue_iid",       Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("issue_title",     Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("total_seconds",   Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("total_hours",     Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("record_count",    Новый ОписаниеТипов("Число"));
	
	Возврат Результат;
	
КонецФункции

// Соединяет элементы массива в строку с разделителем.
//
// Параметры:
//   МассивСтрок  - Массив - массив строк для соединения.
//   Разделитель  - Строка - разделитель между строками.
//
// Возвращаемое значение:
//   Строка - соединённая строка.
//
Функция СоединитьСтроки(Знач МассивСтрок, Знач Разделитель) Экспорт
	
	Результат = "";
	
	Для Каждого Элемент Из МассивСтрок Цикл
		Если Результат <> "" Тогда
			Результат = Результат + Разделитель;
		КонецЕсли;
		
		Результат = Результат + Элемент;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
